#encoding: utf-8
#language: ru

Функционал: СозданиеФункционала
	Как Разработчик
	Я хочу Разработать функционал
	Чтобы Функционал работал
	
Контекст:
	Дано Получены требования от заказчика

Сценарий: Обработка требований
	Когда прочитал требования
	И понял суть задачи
	Тогда я начинаю выбирать способ реализации
	

Сценарий: Разработка согласно требованиям
	Когда Способ реализации выбран 
	Тогда Приступаю к реализации
	

Сценарий: тестирование
	Когда Функционал разработан
	И необходимы объекты созданы
	Тогда приступаю к тестированию
	
